In [1]:
import pandas as pd
import numpy as np

In [5]:
dict1={'gender':['male','female','male','female','male'],
      'married':['yes','no','no','no','yes'],
      'loan_status':['yes','no','no','no','yes']}
df=pd.DataFrame(dict1)
df

   gender married loan_status
0    male     yes         yes
1  female      no          no
2    male      no          no
3  female      no          no
4    male     yes         yes

In [7]:
duplicate_first=df.duplicated(keep="first")
duplicate_first
#  always  first reference is taken if duplicate is there in data frame then it is false
# if duplicate is not there then it is true
# first  means  it give priority to "first"  duplicates
# last  means  it give priority to "last"  duplicates

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [8]:
duplicate_first=df.duplicated(keep="last")
duplicate_first

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [10]:
duplicate_first=df.duplicated()
duplicate_first

0    False
1    False
2    False
3     True
4     True
dtype: bool

In [13]:
duplicate_first=df.duplicated(keep=False)
duplicate_first

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [14]:
df.loc[duplicate_first]

   gender married loan_status
0    male     yes         yes
1  female      no          no
3  female      no          no
4    male     yes         yes

In [15]:
df1=df.drop_duplicates(keep="first")
df1

   gender married loan_status
0    male     yes         yes
1  female      no          no
2    male      no          no

In [18]:
dup_last=df.duplicated(keep="last")
dup_last

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [19]:
~dup_last

0    False
1    False
2     True
3     True
4     True
dtype: bool

In [20]:
df.loc[~dup_last]

   gender married loan_status
2    male      no          no
3  female      no          no
4    male     yes         yes

In [34]:
df1=df.drop_duplicates(keep="last")
df1

   gender married loan_status
2    male      no          no
3  female      no          no
4    male     yes         yes

In [26]:
df2=df.drop_duplicates(keep=False)
df2

  gender married loan_status
2   male      no          no

In [27]:
df1.reset_index()

   index  gender married loan_status
0      2    male      no          no
1      3  female      no          no
2      4    male     yes         yes

In [29]:
df

   gender married loan_status
0    male     yes         yes
1  female      no          no
2    male      no          no
3  female      no          no
4    male     yes         yes

In [30]:
df1.reset_index(drop=True)

   gender married loan_status
0    male      no          no
1  female      no          no
2    male     yes         yes

In [35]:
df1.reset_index(inplace=True,drop=True)
df1

   gender married loan_status
0    male      no          no
1  female      no          no
2    male     yes         yes

In [36]:
df

   gender married loan_status
0    male     yes         yes
1  female      no          no
2    male      no          no
3  female      no          no
4    male     yes         yes

In [38]:
df.drop_duplicates(keep='first',subset=['gender'])
# it will  show only in gender

   gender married loan_status
0    male     yes         yes
1  female      no          no

In [39]:
df.drop_duplicates(keep='first',subset=['married'])

   gender married loan_status
0    male     yes         yes
1  female      no          no

# date.Range()

In [40]:
# day wise
print(pd.date_range('1/11/2000',periods=6))

DatetimeIndex(['2000-01-11', '2000-01-12', '2000-01-13', '2000-01-14',
               '2000-01-15', '2000-01-16'],
              dtype='datetime64[ns]', freq='D')

In [44]:
## year wise
print(pd.date_range('2000/5/2',periods=6,freq='y'))

DatetimeIndex(['2000-12-31', '2001-12-31', '2002-12-31', '2003-12-31',
               '2004-12-31', '2005-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [42]:
## month wise
print(pd.date_range('1/11/2000',periods=6,freq='m'))

DatetimeIndex(['2000-01-31', '2000-02-29', '2000-03-31', '2000-04-30',
               '2000-05-31', '2000-06-30'],
              dtype='datetime64[ns]', freq='M')

In [49]:
start=pd.datetime(2015,2,3)
print("start:",start)

end=pd.datetime(2015,2,25)
print("end:",end)

print(pd.date_range(start,end))

start: 2015-02-03 00:00:00
end: 2015-02-25 00:00:00
DatetimeIndex(['2015-02-03', '2015-02-04', '2015-02-05', '2015-02-06',
               '2015-02-07', '2015-02-08', '2015-02-09', '2015-02-10',
               '2015-02-11', '2015-02-12', '2015-02-13', '2015-02-14',
               '2015-02-15', '2015-02-16', '2015-02-17', '2015-02-18',
               '2015-02-19', '2015-02-20', '2015-02-21', '2015-02-22',
               '2015-02-23', '2015-02-24', '2015-02-25'],
              dtype='datetime64[ns]', freq='D')

C:\Users\DELL\AppData\Local\Temp/ipykernel_1888/3251186268.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  start=pd.datetime(2015,2,3)
C:\Users\DELL\AppData\Local\Temp/ipykernel_1888/3251186268.py:4: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  end=pd.datetime(2015,2,25)

In [53]:
df=pd.DataFrame({'name':["tillu","jp","narsimha",],
                'DOB':['08-05-1997','25-9-1999','26-7-2000']})
df

       name         DOB
0     tillu  08-05-1997
1        jp   25-9-1999
2  narsimha   26-7-2000

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DOB     3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [57]:
df['DOB']=pd.to_datetime(df['DOB'])

In [58]:
df["DOB"].dt.year

0    1997
1    1999
2    2000
Name: DOB, dtype: int64

In [59]:
df["DOB"].dt.month

0    8
1    9
2    7
Name: DOB, dtype: int64

In [60]:
df["DOB"].dt.date

0    1997-08-05
1    1999-09-25
2    2000-07-26
Name: DOB, dtype: object

In [64]:
today=pd.to_datetime('today')
today

Timestamp('2022-05-24 11:10:28.432252')

In [66]:
print(today.year)

2022

In [67]:
today.year-df['DOB'].dt.year

0    25
1    23
2    22
Name: DOB, dtype: int64

In [68]:
df["AGE"]=today.year-df['DOB'].dt.year
df

       name        DOB  AGE
0     tillu 1997-08-05   25
1        jp 1999-09-25   23
2  narsimha 2000-07-26   22

In [1]:
# help(df["DOB"].dt)   total details

In [70]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   DOB     3 non-null      datetime64[ns]
 2   AGE     3 non-null      int64
dtypes: datetime64[ns](1), int64(1), object(1)
memory usage: 200.0+ bytes

In [73]:
df['DOB'].dt.year

0    1997
1    1999
2    2000
Name: DOB, dtype: int64

In [74]:
df['DOB'].dt.day

0     5
1    25
2    26
Name: DOB, dtype: int64

In [75]:
df['DOB'].dt.month

0    8
1    9
2    7
Name: DOB, dtype: int64

In [76]:
df["DOB"].dt.week

C:\Users\DELL\AppData\Local\Temp/ipykernel_1888/2541462711.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated.  Please use Series.dt.isocalendar().week instead.
  df["DOB"].dt.week

0    32
1    38
2    30
Name: DOB, dtype: int64

In [78]:
df["DOB"].dt.day_name()

0      Tuesday
1     Saturday
2    Wednesday
Name: DOB, dtype: object

## calculate age

In [79]:
d1=pd.to_datetime('today')

In [80]:
d2=pd.to_datetime("1998/12/1")

In [81]:
d1-d2

Timedelta('8575 days 11:23:06.551375')

In [87]:
d1.year-d2.year

24

In [2]:
d3=pd.to_datetime('today')

In [3]:
d4=pd.to_datetime('2000/6/6')

In [4]:
d3-d4

Timedelta('8023 days 09:36:30.733242')

In [5]:
d3.year-d4.year

22

In [10]:
d3-d4

Timedelta('8023 days 09:36:30.733242')

In [11]:
d9=pd.to_datetime('1997/12/1')

In [12]:
d5=pd.to_datetime('today')

In [13]:
d5-d9

Timedelta('8941 days 09:40:50.545534')